## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_linux_web_app.main will be created
  + resource "azurerm_linux_web_app" "main" {
      + app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive value)
          + "APPINSIGHTS_PROFILERFEATURE_VERSION"        = "1.0.0"
          + "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"        = "1.0.0"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          + "AZURE_AD_CLIENT_ID"                         = "6450350b-9871-4d94-85e5-5513469e1668"
          + "AZURE_AD_CLIENT_SECRET"                     = "*****"
          + "AZURE_AD_TENANT_ID"                         = "9ca75128-a244-4596-877b-f24828e476e2"
          + "AZURE_OPENAI_API_DEPLOYMENT_NAME"           = "gpt-35-turbo-16k"
          + "AZURE_OPENAI_API_INSTANCE_NAME"             = "private-chatgpt-vkatttry"
          + "AZURE_OPENAI_API_KEY"                       = "*****"
          + "AZURE_OPENAI_API_VERSION"                   = "2023-03-15-preview"
          + "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          + "DiagnosticServices_EXTENSION_VERSION"       = "~3"
          + "FUNCTION_APP_ENDPOINT"                      = "func-private-chatgpt-vkatttry.azurewebsites.net/api"
          + "FUNCTION_APP_KEY"                           = (sensitive value)
          + "KEY_VAULT_URI"                              = "https://kvprivatechatgptvkatttry.vault.azure.net/"
          + "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"   = ""
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "app-private-chatgpt-vkatttry"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-private-chatgpt-vkatttry-application"
      + service_plan_id                   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-vkatttry-application/providers/Microsoft.Web/serverfarms/asp-private-chatgpt-vkatttry"
      + site_credential                   = (sensitive value)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "node server.js"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = true
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET",
            ]
        }
    }

  # azurerm_linux_web_app_slot.qa will be created
  + resource "azurerm_linux_web_app_slot" "qa" {
      + app_metadata                      = (known after apply)
      + app_service_id                    = (known after apply)
      + app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive value)
          + "APPINSIGHTS_PROFILERFEATURE_VERSION"        = "1.0.0"
          + "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"        = "1.0.0"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          + "AZURE_AD_CLIENT_ID"                         = "6450350b-9871-4d94-85e5-5513469e1668"
          + "AZURE_AD_CLIENT_SECRET"                     = "*****"
          + "AZURE_AD_TENANT_ID"                         = "9ca75128-a244-4596-877b-f24828e476e2"
          + "AZURE_OPENAI_API_DEPLOYMENT_NAME"           = "gpt-35-turbo-16k"
          + "AZURE_OPENAI_API_INSTANCE_NAME"             = "private-chatgpt-vkatttry"
          + "AZURE_OPENAI_API_KEY"                       = "*****"
          + "AZURE_OPENAI_API_VERSION"                   = "2023-03-15-preview"
          + "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          + "DiagnosticServices_EXTENSION_VERSION"       = "~3"
          + "FUNCTION_APP_ENDPOINT"                      = "func-private-chatgpt-vkatttry.azurewebsites.net/api"
          + "FUNCTION_APP_KEY"                           = (sensitive value)
          + "KEY_VAULT_URI"                              = "https://kvprivatechatgptvkatttry.vault.azure.net/"
          + "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"   = ""
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + name                              = "qa"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + service_plan_id                   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-vkatttry-application/providers/Microsoft.Web/serverfarms/asp-private-chatgpt-vkatttry"
      + site_credential                   = (sensitive value)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "node server.js"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = true
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }
    }

  # random_uuid.enterprise_app_admin[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from random_uuid.enterprise_app_admin)
  - resource "random_uuid" "enterprise_app_admin" {
      - id     = "650750b3-78f9-428b-ce4d-ec9d078452ae" -> null
      - result = "650750b3-78f9-428b-ce4d-ec9d078452ae" -> null
    }

  # random_uuid.enterprise_app_user[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from random_uuid.enterprise_app_user)
  - resource "random_uuid" "enterprise_app_user" {
      - id     = "b8741806-17af-a025-0c9b-34ed307d3880" -> null
      - result = "b8741806-17af-a025-0c9b-34ed307d3880" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + web_app_name         = "app-private-chatgpt-vkatttry"
```
</details>